apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_dfsdm.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <sys/ioctl.h>

#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <string.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>

#include "chip.h"
#include "stm32l4_rcc.h"
#include "stm32_tim.h"
#include "stm32l4_dma.h"
#include "stm32l4_dfsdm.h"

/* ADC "upper half" support must be enabled. DFSDM are ADC devices. */

#ifdef CONFIG_ADC

/* The peripheral must be enabled */

#ifdef CONFIG_STM32_DFSDM

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Sanity checking **********************************************************/

#if !defined(CONFIG_STM32_DFSDM1_FLT0) && \
    !defined(CONFIG_STM32_DFSDM1_FLT1) && \
    !defined(CONFIG_STM32_DFSDM1_FLT2) && !defined(CONFIG_STM32_DFSDM1_FLT3)
#  error "At least one DFSDM filter must be defined"
#endif

#if defined(CONFIG_STM32_STM32L4X3)
#  if defined(CONFIG_STM32_DFSDM1_FLT2) || defined(CONFIG_STM32_DFSDM1_FLT3)
#    error "Non-existent DFSDM filter defined"
#  endif
#endif

/* Abbreviated register access **********************************************/

#define CHCFGR1_OFFSET(priv)   STM32_DFSDM_CHCFGR1_OFFSET((priv)->current)
#define CHCFGR2_OFFSET(priv)   STM32_DFSDM_CHCFGR2_OFFSET((priv)->current)

#define FLTCR1_OFFSET(priv)    STM32_DFSDM_FLTCR1_OFFSET((priv)->intf)
#define FLTCR2_OFFSET(priv)    STM32_DFSDM_FLTCR2_OFFSET((priv)->intf)
#define FLTISR_OFFSET(priv)    STM32_DFSDM_FLTISR_OFFSET((priv)->intf)
#define FLTICR_OFFSET(priv)    STM32_DFSDM_FLTICR_OFFSET((priv)->intf)
#define FLTFCR_OFFSET(priv)    STM32_DFSDM_FLTFCR_OFFSET((priv)->intf)
#define FLTRDATAR_OFFSET(priv) STM32_DFSDM_FLTRDATAR_OFFSET((priv)->intf)
#define FLTAWHTR_OFFSET(priv)  STM32_DFSDM_FLTAWHTR_OFFSET((priv)->intf)
#define FLTAWLTR_OFFSET(priv)  STM32_DFSDM_FLTAWLTR_OFFSET((priv)->intf)
#define FLTAWSR_OFFSET(priv)   STM32_DFSDM_FLTAWSR_OFFSET((priv)->intf)
#define FLTAWCFR_OFFSET(priv)  STM32_DFSDM_FLTAWCFR_OFFSET((priv)->intf)
#define FLTEXMAX_OFFSET(priv)  STM32_DFSDM_FLTEXMAX_OFFSET((priv)->intf)
#define FLTEXMIN_OFFSET(priv)  STM32_DFSDM_FLTEXMIN_OFFSET((priv)->intf)

/* DFSDM Filter interrupts **************************************************/

/* These bits are same in FLRCR2 and FLTISR (FLTICR only has JOVR and ROVR) */

#define DFSDM_INT_JEOC   DFSDM_FLTCR2_JEOCIE
#define DFSDM_INT_REOC   DFSDM_FLTCR2_REOCIE
#define DFSDM_INT_JOVR   DFSDM_FLTCR2_JOWRIE
#define DFSDM_INT_ROVR   DFSDM_FLTCR2_ROWRIE
#define DFSDM_INT_AWD    DFSDM_FLTCR2_AWDIE

/* SCDIE and CKABIE are not in this, as the bits exist only in FLT0 filter
 * CR2.
 */

#define DFSDM_INT_MASK (DFSDM_FLTCR2_JEOCIE | DFSDM_FLTCR2_REOCIE | \
                        DFSDM_FLTCR2_JOWRIE | DFSDM_FLTCR2_ROWRIE | \
                        DFSDM_FLTCR2_AWDIE)

/* Similarly, this is missing SCDF and CKABF as special support is needed. */

#define DFSDM_ISR_MASK (DFSDM_FLTISR_JEOCF | DFSDM_FLTISR_REOCF | \
                        DFSDM_FLTISR_JOVRF | DFSDM_FLTISR_ROVRF | \
                        DFSDM_FLTISR_AWDF)

/* DFSDM Channels/DMA *******************************************************/

/* The maximum number of channels that can be sampled.  While DMA support is
 * very nice for reliable multi-channel sampling, the STM32L4 can function
 * without, although there is a risk of overrun.
 */

#if defined(CONFIG_STM32_STM32L4X3)
#  define DFSDM_MAX_CHANNELS 4
#  define DFSDM_MAX_FILTERS  2
#else
#  define DFSDM_MAX_CHANNELS 8
#  define DFSDM_MAX_FILTERS  4
#endif

#ifdef DFSDM_HAVE_DMA
#  if !defined(CONFIG_STM32_DMA1) && !defined(CONFIG_STM32_DMAMUX)
#    error "STM32L4 DFSDM DMA support requires CONFIG_STM32_DMA1"
#  endif
#endif

/* We currently only use DMA to read DFSDM conversion results, not for
 * parallel inputs to DFSDM_CHyDATINR register.
 */

#define DFSDM_DMA_CONTROL_WORD (DMA_CCR_MSIZE_32BITS | \
                                DMA_CCR_PSIZE_32BITS | \
                                DMA_CCR_MINC | \
                                DMA_CCR_CIRC)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the state of one DFSDM block */

struct stm32_dev_s
{
  const struct adc_callback_s *cb;
  uint8_t irq;          /* Interrupt generated by this block */
  uint8_t nchannels;    /* Number of channels */
  uint8_t cchannels;    /* Number of configured channels */
  uint8_t intf;         /* DFSDM filter number */
  uint8_t current;      /* Current channel being converted */
#ifdef DFSDM_HAVE_DMA
  uint8_t dmachan;      /* DMA channel needed by this filter */
  bool    hasdma;       /* True: This filter supports DMA */
#endif
#ifdef DFSDM_HAVE_TIMER
  uint8_t trigger;      /* Timer trigger channel: 0=CC1, 1=CC2, 2=CC3,
                         * 3=CC4, 4=TRGO, 5=TRGO2 */
#endif
  xcpt_t   isr;         /* Interrupt handler for this filter block */
  uint32_t base;        /* Base address of registers */
#ifdef DFSDM_HAVE_TIMER
  uint32_t tbase;       /* Base address of timer */
  uint32_t extsel;      /* EXTSEL value used */
  uint32_t pclck;       /* The PCLK frequency that drives this timer */
  uint32_t freq;        /* The desired frequency of conversions */
#endif

#ifdef DFSDM_HAVE_DMA
  DMA_HANDLE dma;       /* Allocated DMA channel */

  /* DMA transfer buffer */

  uint32_t dmabuffer[DFSDM_MAX_CHANNELS];
#endif

