apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
  /* List of selected channels to sample */

  uint8_t  chanlist[DFSDM_MAX_CHANNELS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register access */

static uint32_t dfsdm_getreg(struct stm32_dev_s *priv, int offset);
static void     dfsdm_putreg(struct stm32_dev_s *priv, int offset,
                             uint32_t value);
static void     dfsdm_modifyreg(struct stm32_dev_s *priv, int offset,
                                uint32_t clrbits, uint32_t setbits);

#ifdef DFSDM_HAVE_TIMER
static uint16_t tim_getreg(struct stm32_dev_s *priv, int offset);
static void     tim_putreg(struct stm32_dev_s *priv, int offset,
                           uint16_t value);
static void     tim_modifyreg(struct stm32_dev_s *priv, int offset,
                              uint16_t clrbits, uint16_t setbits);
static void     tim_dumpregs(struct stm32_dev_s *priv,
                             const char *msg);
#endif

/* Miscellaneous Helpers */

static void dfsdm_rccreset(struct stm32_dev_s *priv, bool reset);
static void dfsdm_enable(struct stm32_dev_s *priv);
static int  dfsdm_set_ch(struct adc_dev_s *dev, uint8_t ch);

#ifdef DFSDM_HAVE_TIMER
static void dfsdm_timstart(struct stm32_dev_s *priv, bool enable);
static int  dfsdm_timinit(struct stm32_dev_s *priv);
#endif

#ifdef DFSDM_HAVE_DMA
static void dfsdm_dmaconvcallback(DMA_HANDLE handle, uint8_t isr,
                                  void *arg);
#endif

static void dfsdm_startconv(struct stm32_dev_s *priv, bool enable);

/* Interrupt Handler */

static int dfsdm_interrupt(struct adc_dev_s *dev, uint32_t regval);
#if defined(CONFIG_STM32_DFSDM1_FLT0)
static int dfsdm_flt0_interrupt(int irq, void *context, void *arg);
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT1)
static int dfsdm_flt1_interrupt(int irq, void *context, void *arg);
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT2)
static int dfsdm_flt2_interrupt(int irq, void *context, void *arg);
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT3)
static int dfsdm_flt3_interrupt(int irq, void *context, void *arg);
#endif

/* ADC Driver Methods */

static int  dfsdm_bind(struct adc_dev_s *dev,
                       const struct adc_callback_s *callback);
static void dfsdm_reset(struct adc_dev_s *dev);
static int  dfsdm_setup(struct adc_dev_s *dev);
static void dfsdm_shutdown(struct adc_dev_s *dev);
static void dfsdm_rxint(struct adc_dev_s *dev, bool enable);
static int  dfsdm_ioctl(struct adc_dev_s *dev,
                        int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC interface operations */

static const struct adc_ops_s g_adcops =
{
  .ao_bind        = dfsdm_bind,
  .ao_reset       = dfsdm_reset,
  .ao_setup       = dfsdm_setup,
  .ao_shutdown    = dfsdm_shutdown,
  .ao_rxint       = dfsdm_rxint,
  .ao_ioctl       = dfsdm_ioctl,
};

/* DFSDM FLT0 */

#if defined(CONFIG_STM32_DFSDM1_FLT0)
static struct stm32_dev_s g_dfsdmpriv0 =
{
  .irq         = STM32_IRQ_DFSDM0,
  .isr         = dfsdm_flt0_interrupt,
  .intf        = 0,
  .base        = STM32_DFSDM_BASE,
#ifdef DFSDM_HAVE_TIMER
  .trigger     = CONFIG_STM32_DFSDM_TIMTRIG,
  .tbase       = DFSDM_TIMER_BASE,
  .extsel      = DFSDM_JEXTSEL_VALUE,
  .pclck       = DFSDM_TIMER_PCLK_FREQUENCY,
  .freq        = CONFIG_STM32_DFSDM_SAMPLE_FREQUENCY,
#endif
#ifdef DFSDM_HAVE_DMA
  .dmachan     = DMACHAN_DFSDM0,
  .hasdma      = true,
#endif
};

static struct adc_dev_s g_dfsdmdev0 =
{
  .ad_ops      = &g_adcops,
  .ad_priv     = &g_dfsdmpriv0,
};
#endif

/* DFSDM FLT1 */

#if defined(CONFIG_STM32_DFSDM1_FLT1)
static struct stm32_dev_s g_dfsdmpriv1 =
{
  .irq         = STM32_IRQ_DFSDM1,
  .isr         = dfsdm_flt1_interrupt,
  .intf        = 1,
  .base        = STM32_DFSDM_BASE,
#ifdef DFSDM_HAVE_TIMER
  .trigger     = CONFIG_STM32_DFSDM_TIMTRIG,
  .tbase       = DFSDM_TIMER_BASE,
  .extsel      = DFSDM_JEXTSEL_VALUE,
  .pclck       = DFSDM_TIMER_PCLK_FREQUENCY,
  .freq        = CONFIG_STM32_DFSDM_SAMPLE_FREQUENCY,
#endif
#ifdef DFSDM_HAVE_DMA
  .dmachan     = DMACHAN_DFSDM1,
  .hasdma      = true,
#endif
};

static struct adc_dev_s g_dfsdmdev1 =
{
  .ad_ops      = &g_adcops,
  .ad_priv     = &g_dfsdmpriv1,
};
#endif

/* DFSDM FLT2 */

#if defined(CONFIG_STM32_DFSDM1_FLT2)
static struct stm32_dev_s g_dfsdmpriv2 =
{
  .irq         = STM32_IRQ_DFSDM2,
  .isr         = dfsdm_flt2_interrupt,
  .intf        = 0,
  .base        = STM32_DFSDM_BASE,
#ifdef DFSDM_HAVE_TIMER
  .trigger     = CONFIG_STM32_DFSDM_TIMTRIG,
  .tbase       = DFSDM_TIMER_BASE,
  .extsel      = DFSDM_JEXTSEL_VALUE,
  .pclck       = DFSDM_TIMER_PCLK_FREQUENCY,
  .freq        = CONFIG_STM32_DFSDM_SAMPLE_FREQUENCY,
#endif
#ifdef DFSDM_HAVE_DMA
  .dmachan     = DMACHAN_DFSDM2,
  .hasdma      = true,
#endif
};

static struct adc_dev_s g_dfsdmdev2 =
{
  .ad_ops      = &g_adcops,
  .ad_priv     = &g_dfsdmpriv2,
};
#endif

/* DFSDM FLT3 */

#if defined(CONFIG_STM32_DFSDM1_FLT3)
static struct stm32_dev_s g_dfsdmpriv3 =
{
  .irq         = STM32_IRQ_DFSDM3,
  .isr         = dfsdm_flt3_interrupt,
  .intf        = 0,
  .base        = STM32_DFSDM_BASE,
#ifdef DFSDM_HAVE_TIMER
  .trigger     = CONFIG_STM32_DFSDM_TIMTRIG,
  .tbase       = DFSDM_TIMER_BASE,
  .extsel      = DFSDM_JEXTSEL_VALUE,
  .pclck       = DFSDM_TIMER_PCLK_FREQUENCY,
  .freq        = CONFIG_STM32_DFSDM_SAMPLE_FREQUENCY,
#endif
#ifdef DFSDM_HAVE_DMA
  .dmachan     = DMACHAN_DFSDM3,
  .hasdma      = true,
#endif
};

static struct adc_dev_s g_dfsdmdev3 =
{
  .ad_ops      = &g_adcops,
  .ad_priv     = &g_dfsdmpriv3,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: dfsdm_getreg
 *
 * Description:
 *   Read the value of a DFSDM register.
 *
 * Input Parameters:
 *   priv   - A reference to the DFSDM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t dfsdm_getreg(struct stm32_dev_s *priv, int offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: dfsdm_putreg
 *
 * Description:
 *   Write a value to an DFSDM register.
 *
 * Input Parameters:
 *   priv   - A reference to the DFSDM block status
 *   offset - The offset to the register to write to
 *   value  - The value to write to the register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void dfsdm_putreg(struct stm32_dev_s *priv, int offset,
                         uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: dfsdm_modifyreg
 *
 * Description:
 *   Modify the value of an DFSDM register (not atomic).
 *
 * Input Parameters:
 *   priv    - A reference to the DFSDM block status
 *   offset  - The offset to the register to modify
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void dfsdm_modifyreg(struct stm32_dev_s *priv, int offset,
                            uint32_t clrbits, uint32_t setbits)
{
  dfsdm_putreg(priv, offset,
              (dfsdm_getreg(priv, offset) & ~clrbits) | setbits);
}

/****************************************************************************
 * Name: tim_getreg
 *
 * Description:
 *   Read the value of an DFSDM timer register.
 *
 * Input Parameters:
 *   priv   - A reference to the DFSDM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

