apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
  /* Save the modified register values */

  tim_putreg(priv, STM32_GTIM_CR2_OFFSET, cr2);
  tim_putreg(priv, STM32_GTIM_CCMR1_OFFSET, ccmr1);
  tim_putreg(priv, STM32_GTIM_CCMR2_OFFSET, ccmr2);
  tim_putreg(priv, STM32_GTIM_CCER_OFFSET, ccer);
  tim_putreg(priv, STM32_GTIM_EGR_OFFSET, egr);

  /* Set the ARR Preload Bit */

  tim_modifyreg(priv, STM32_GTIM_CR1_OFFSET, 0, GTIM_CR1_ARPE);

  /* Enable the timer counter */

  dfsdm_timstart(priv, true);

  tim_dumpregs(priv, "After starting timers");

  return OK;
}
#endif

/****************************************************************************
 * Name: dfsdm_wdog_enable
 *
 * Description:
 *   Enable the analog watchdog. This is for filter watchdog only, channel
 *   watchdogs are not supported by current implementation.
 *
 ****************************************************************************/

static void dfsdm_wdog_enable(struct stm32_dev_s *priv)
{
  uint32_t regval;

  /* Initialize the Analog watchdog for current channel
   * and switch to analog watchdog interrupt
   */

  regval  = dfsdm_getreg(priv, FLTCR2_OFFSET(priv));
  regval |= DFSDM_FLTCR2_AWDCH(priv->current);
  regval |= DFSDM_INT_AWD;
  regval &= ~(DFSDM_INT_REOC | DFSDM_INT_JEOC);
  dfsdm_putreg(priv, FLTCR2_OFFSET(priv), regval);
}

/****************************************************************************
 * Name: dfsdm_startconv
 *
 * Description:
 *   Start (or stop) the ADC conversion process
 *
 * Input Parameters:
 *   priv - A reference to the DFSDM block status
 *   enable - True: Start conversion
 *
 ****************************************************************************/

static void dfsdm_startconv(struct stm32_dev_s *priv, bool enable)
{
  uint32_t regval;

  ainfo("enable: %d\n", enable ? 1 : 0);

  regval = dfsdm_getreg(priv, FLTCR1_OFFSET(priv));
  if (enable)
    {
      /* Enable the filter */

      regval |= DFSDM_FLTCR1_DFEN;
    }
  else
    {
      /* Disable the filter */

      regval &= ~DFSDM_FLTCR1_DFEN;
    }

  dfsdm_putreg(priv, FLTCR1_OFFSET(priv), regval);

  if (enable)
    {
      /* Start conversion of regular channels */

      regval |= DFSDM_FLTCR1_RSWSTART;
      dfsdm_putreg(priv, FLTCR1_OFFSET(priv), regval);
    }
}

/****************************************************************************
 * Name: dfsdm_rccreset
 *
 * Description:
 *   Deinitializes the DFSDM peripheral registers to their default
 *   reset values.
 *
 * Input Parameters:
 *   priv - A reference to the DFSDM block status
 *   reset - Condition, set or reset
 *
 ****************************************************************************/

static void dfsdm_rccreset(struct stm32_dev_s *priv, bool reset)
{
  irqstate_t flags;
  uint32_t regval;

  /* First must disable interrupts because the APB2RSTR register is used by
   * several different drivers.
   */

  flags = enter_critical_section();

  /* Set or clear the selected bit in the APB2 reset register */

  regval = getreg32(STM32_RCC_APB2RSTR);
  if (reset)
    {
      regval |= RCC_APB2RSTR_DFSDMRST;
    }
  else
    {
      regval &= ~RCC_APB2RSTR_DFSDMRST;
    }

  putreg32(regval, STM32_RCC_APB2RSTR);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: dfsdm_enable
 *
 * Description:
 *   Enables the DFSDM peripheral.
 *
 * Input Parameters:
 *   priv - A reference to the DFSDM block status
 *
 ****************************************************************************/

static void dfsdm_enable(struct stm32_dev_s *priv)
{
  uint32_t regval;

  regval = dfsdm_getreg(priv, STM32_DFSDM_CH0CFGR1_OFFSET);

  /* Enable DFSMDM */

  regval |= DFSDM_CH0CFGR1_DFSDMEN;
  dfsdm_putreg(priv, STM32_DFSDM_CH0CFGR1_OFFSET, regval);
}

/****************************************************************************
 * Name: dfsdm_bind
 *
 * Description:
 *   Bind the upper-half driver callbacks to the lower-half implementation.
 *   This must be called early in order to receive ADC event notifications.
 *
 ****************************************************************************/

static int dfsdm_bind(struct adc_dev_s *dev,
                      const struct adc_callback_s *callback)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;

  DEBUGASSERT(priv != NULL);
  priv->cb = callback;
  return OK;
}

/****************************************************************************
 * Name: dfsdm_reset
 *
 * Description:
 *   Reset the DFSDM device.  Called early to initialize the hardware. This
 *   is called, before dfsdm_setup() and on error conditions.
 *
 ****************************************************************************/

static void dfsdm_reset(struct adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;

  /* Enable DFSDM reset state */

  dfsdm_rccreset(priv, true);

  /* Release DFSDM from reset state */

  dfsdm_rccreset(priv, false);
}

/****************************************************************************
 * Name: dfsdm_setup
 *
 * Description:
 *   Configure the DFSDM. This method is called the first time that the ADC
 *   device is opened.  This will occur when the port is first opened.
 *   This setup includes configuring and attaching ADC interrupts.
 *   Interrupts are all disabled upon return.
 *
 ****************************************************************************/

static int dfsdm_setup(struct adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  int ret;
  irqstate_t flags;
  uint32_t clrbits;
  uint32_t setbits;

  /* Attach the interrupt */

  ret = irq_attach(priv->irq, priv->isr, NULL);
  if (ret < 0)
    {
      ainfo("irq_attach failed: %d\n", ret);
      return ret;
    }

  flags = enter_critical_section();

  /* Make sure that the device is in the powered up, reset state. */

  dfsdm_reset(dev);

  /* Initialize the filter settings.  */

  clrbits = 0;
  setbits = DFSDM_FLTFCR_FORD_SINC1 | \
            DFSDM_FLTFCR_FOSR(0) | \
            DFSDM_FLTFCR_IOSR(0);

  dfsdm_modifyreg(priv, FLTFCR_OFFSET(priv), clrbits, setbits);

  setbits = 0;

#ifdef DFSDM_HAVE_DMA
  if (priv->hasdma)
    {
      /* Enable DMA */

      setbits |= DFSDM_FLTCR1_RDMAEN;
    }
#endif

  /* Disable continuous mode and synchronized mode */

  clrbits = DFSDM_FLTCR1_RCONT | DFSDM_FLTCR1_RSYNC;

  /* Set CR1 configuration */

