apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
  dfsdm_modifyreg(priv, FLTCR1_OFFSET(priv), clrbits, setbits);

  /* Configuration of the channel conversions */

  dfsdm_set_ch(dev, 0);

#ifdef DFSDM_HAVE_DMA

  /* Enable DMA */

  if (priv->hasdma)
    {
      /* Stop and free DMA if it was started before */

      if (priv->dma != NULL)
        {
          stm32_dmastop(priv->dma);
          stm32_dmafree(priv->dma);
        }

      priv->dma = stm32_dmachannel(priv->dmachan);

      stm32_dmasetup(priv->dma,
                       priv->base + FLTRDATAR_OFFSET(priv),
                       (uint32_t)priv->dmabuffer,
                       priv->nchannels,
                       DFSDM_DMA_CONTROL_WORD);

      stm32_dmastart(priv->dma, dfsdm_dmaconvcallback, dev, false);
    }
#endif

  dfsdm_enable(priv);

#ifdef DFSDM_HAVE_TIMER

  /* TODO: timers would require injected conversions, which are
   * not implemented at the moment.
   */
#  warning "DFSDM Timer not fully implemented!"

  if (priv->tbase != 0)
    {
      ret = dfsdm_timinit(priv);
      if (ret < 0)
        {
          aerr("ERROR: dfsdm_timinit failed: %d\n", ret);
        }
    }
#endif

  leave_critical_section(flags);

  ainfo("ISR:   0x%08" PRIx32 " FCR:    0x%08" PRIx32
        " CR1:  0x%08" PRIx32 " CR2: 0x%08" PRIx32 "\n",
        dfsdm_getreg(priv, FLTISR_OFFSET(priv)),
        dfsdm_getreg(priv, FLTFCR_OFFSET(priv)),
        dfsdm_getreg(priv, FLTCR1_OFFSET(priv)),
        dfsdm_getreg(priv, FLTCR2_OFFSET(priv)));

  /* Enable the DFSDM FLT interrupt */

  ainfo("Enable the FLT interrupt: irq=%d\n", priv->irq);
  up_enable_irq(priv->irq);

  return ret;
}

/****************************************************************************
 * Name: dfsdm_shutdown
 *
 * Description:
 *   Disable the DFSDM.  This method is called when the ADC device is closed.
 *   This method reverses the operation the setup method.
 *
 ****************************************************************************/

static void dfsdm_shutdown(struct adc_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;

  /* Disable interrupts and detach the FLT interrupt handler */

  up_disable_irq(priv->irq);
  irq_detach(priv->irq);

  /* Disable and reset the DFSDM module */

  dfsdm_reset(dev);
}

/****************************************************************************
 * Name: dfsdm_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

static void dfsdm_rxint(struct adc_dev_s *dev, bool enable)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t regval;

  ainfo("intf: %d enable: %d\n", priv->intf, enable ? 1 : 0);

  regval = dfsdm_getreg(priv, FLTCR2_OFFSET(priv));
  if (enable)
    {
      /* Enable end of conversion interrupt */

      regval |= DFSDM_INT_REOC;
    }
  else
    {
      /* Disable all interrupts */

      regval &= ~DFSDM_INT_MASK;
    }

  dfsdm_putreg(priv, FLTCR2_OFFSET(priv), regval);
}

/****************************************************************************
 * Name: dfsdm_set_ch
 *
 * Description:
 *   Sets the DFSDM channel.
 *
 * Input Parameters:
 *   dev - pointer to device structure used by the driver
 *   ch  - ADC channel number + 1. 0 reserved for all configured channels
 *
 * Returned Value:
 *   int - errno
 *
 ****************************************************************************/

static int dfsdm_set_ch(struct adc_dev_s *dev, uint8_t ch)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t regval;
  int i;

  if (ch == 0)
    {
      priv->current   = 0;
      priv->nchannels = priv->cchannels;
    }
  else
    {
      for (i = 0; i < priv->cchannels && priv->chanlist[i] != ch - 1; i++)
        {
        }

      if (i >= priv->cchannels)
        {
          return -ENODEV;
        }

      priv->current   = i;
      priv->nchannels = 1;
    }

  DEBUGASSERT(priv->nchannels <= DFSDM_MAX_CHANNELS);

  /* Select channel for filter.
   * TODO: regular conversion supports one channel only.
   */

  /* Set channel in CR1 configuration */

  regval  = dfsdm_getreg(priv, FLTCR1_OFFSET(priv));
  regval |= DFSDM_FLTCR1_RCH(priv->current);
  dfsdm_putreg(priv, FLTCR1_OFFSET(priv), regval);

  /* Set CHCFGR1 input data configuration */

  regval  = dfsdm_getreg(priv, CHCFGR1_OFFSET(priv));
#ifdef ADC_HAVE_DFSDM
  regval |= DFSDM_CHCFGR1_DATMPX_ADC;
#else
  regval |= DFSDM_CHCFGR1_DATMPX_EXT;

  /* regval |= DFSDM_CHCFGR1_DATMPX_DATINR; */
#endif
  dfsdm_putreg(priv, CHCFGR1_OFFSET(priv), regval);

  /* Enable the channel */

  regval |= DFSDM_CHCFGR1_CHEN;
  dfsdm_putreg(priv, CHCFGR1_OFFSET(priv), regval);

  return OK;
}

/****************************************************************************
 * Name: dfsdm_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method.
 *
 * Input Parameters:
 *   dev - pointer to device structure used by the driver
 *   cmd - command
 *   arg - arguments passed with command
 *
 * Returned Value:
 *
 ****************************************************************************/

static int dfsdm_ioctl(struct adc_dev_s *dev, int cmd, unsigned long arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t regval;
  uint32_t tmp;
  int ret = OK;

  switch (cmd)
    {
      case ANIOC_TRIGGER:
        dfsdm_startconv(priv, true);
        break;

      case ANIOC_WDOG_UPPER: /* Set watchdog upper threshold */
        {
          regval = dfsdm_getreg(priv, FLTAWLTR_OFFSET(priv));

          /* Verify new upper threshold greater than lower threshold */

          tmp = (regval & DFSDM_AWLTR_AWLT_MASK) >> DFSDM_AWLTR_AWLT_SHIFT;
          if (arg < tmp)
            {
              ret = -EINVAL;
              break;
            }

          /* Set the watchdog threshold register */

          regval = ((arg << DFSDM_AWHTR_AWHT_SHIFT) & DFSDM_AWHTR_AWHT_MASK);

          dfsdm_putreg(priv, FLTAWHTR_OFFSET(priv), regval);

          /* Ensure analog watchdog is enabled */

          dfsdm_wdog_enable(priv);
        }
        break;

      case ANIOC_WDOG_LOWER: /* Set watchdog lower threshold */
        {
          regval = dfsdm_getreg(priv, FLTAWHTR_OFFSET(priv));

          /* Verify new lower threshold less than upper threshold */

