apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
          tmp = (regval & DFSDM_AWHTR_AWHT_MASK) >> DFSDM_AWHTR_AWHT_SHIFT;
          if (arg > tmp)
            {
              ret = -EINVAL;
              break;
            }

          /* Set the watchdog threshold register */

          regval = ((arg << DFSDM_AWLTR_AWLT_SHIFT) & DFSDM_AWLTR_AWLT_MASK);
          dfsdm_putreg(priv, FLTAWLTR_OFFSET(priv), regval);

          /* Ensure analog watchdog is enabled */

          dfsdm_wdog_enable(priv);
        }
        break;

      default:
        aerr("ERROR: Unknown cmd: %d\n", cmd);
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: dfsdm_interrupt
 *
 * Description:
 *   Common DFSDM interrupt handler.
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

static int dfsdm_interrupt(struct adc_dev_s *dev, uint32_t isr)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t value;

  /* Identifies the interruption AWD or OVR */

  if ((isr & DFSDM_INT_AWD) != 0)
    {
      value = dfsdm_getreg(priv, FLTAWSR_OFFSET(priv));

      awarn("WARNING: Analog Watchdog, extreme value on channels (0x%x)!\n",
            value);

      /* Clear AWD flags */

      dfsdm_putreg(priv, FLTAWCFR_OFFSET(priv), value);

      /* Stop ADC conversions to avoid continuous interrupts */

      dfsdm_startconv(priv, false);
    }

  if ((isr & DFSDM_INT_ROVR) != 0)
    {
      awarn("WARNING: Regular conversion overrun has occurred!\n");

      /* Clear overrun flag */

      dfsdm_putreg(priv, FLTAWCFR_OFFSET(priv), DFSDM_INT_ROVR);
    }

#if 0
  if ((isr & DFSDM_INT_JOVR) != 0)
    {
      awarn("WARNING: Injected conversion overrun has occurred!\n");

      /* Clear overrun flag */

      dfsdm_putreg(priv, FLTAWCFR_OFFSET(priv), DFSDM_INT_JOVR);
    }
#endif

  /* EOC: End of conversion */

  if ((isr & DFSDM_INT_REOC) != 0)
    {
      /* Read the converted value and clear EOC bit
       * (It is cleared by reading the FLTRDATAR)
       */

      value = dfsdm_getreg(priv, FLTRDATAR_OFFSET(priv));
      value = (value & DFSDM_FLTRDATAR_RDATA_MASK) >>
               DFSDM_FLTRDATAR_RDATA_SHIFT;

      /* Verify that the upper-half driver has bound its callback functions */

      if (priv->cb != NULL)
        {
          /* Give the ADC data to the ADC driver.  The ADC receive() method
           * accepts 3 parameters:
           *
           * 1) The first is the ADC device instance for this ADC block.
           * 2) The second is the channel number for the data, and
           * 3) The third is the converted data for the channel.
           */

          DEBUGASSERT(priv->cb->au_receive != NULL);
          priv->cb->au_receive(dev, priv->chanlist[priv->current], value);
        }

      /* Set the channel number of the next channel that will complete
       * conversion
       */

      priv->current++;

      if (priv->current >= priv->nchannels)
        {
          /* Restart the conversion sequence from the beginning */

          priv->current = 0;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: dfsdm_flt0_interrupt
 *
 * Description:
 *   DFSDM filter interrupt handler
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_DFSDM1_FLT0)
static int dfsdm_flt0_interrupt(int irq, void *context, void *arg)
{
  uint32_t regval;
  uint32_t pending;

  regval = getreg32(STM32_DFSDM_FLTISR(0));
  pending = regval & DFSDM_ISR_MASK;
  if (pending != 0)
    {
      dfsdm_interrupt(&g_dfsdmdev0, regval);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: dfsdm_flt1_interrupt
 *
 * Description:
 *   DFSDM filter interrupt handler
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_DFSDM1_FLT1)
static int dfsdm_flt1_interrupt(int irq, void *context, void *arg)
{
  uint32_t regval;
  uint32_t pending;

  regval = getreg32(STM32_DFSDM_FLTISR(1));
  pending = regval & DFSDM_ISR_MASK;
  if (pending != 0)
    {
      dfsdm_interrupt(&g_dfsdmdev1, regval);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: dfsdm_flt2_interrupt
 *
 * Description:
 *   DFSDM filter interrupt handler
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_DFSDM1_FLT2)
static int dfsdm_flt2_interrupt(int irq, void *context, void *arg)
{
  uint32_t regval;
  uint32_t pending;

  regval = getreg32(STM32_DFSDM_FLTISR(2));
  pending = regval & DFSDM_ISR_MASK;
  if (pending != 0)
    {
      dfsdm_interrupt(&g_dfsdmdev2, regval);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: dfsdm_flt3_interrupt
 *
 * Description:
 *   DFSDM filter interrupt handler
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_DFSDM1_FLT3)
static int dfsdm_flt3_interrupt(int irq, void *context, void *arg)
{
  uint32_t regval;
  uint32_t pending;

  regval = getreg32(STM32_DFSDM_FLTISR(3));
  pending = regval & DFSDM_ISR_MASK;
  if (pending != 0)
    {
      dfsdm_interrupt(&g_dfsdmdev3, regval);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: dfsdm_dmaconvcallback
 *
 * Description:
 *   Callback for DMA.  Called from the DMA transfer complete interrupt after
 *   all channels have been converted and transferred with DMA.
 *
 * Input Parameters:
 *
 *   handle - handle to DMA
 *   isr -
 *   arg - device
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef DFSDM_HAVE_DMA
static void dfsdm_dmaconvcallback(DMA_HANDLE handle,
                                  uint8_t isr, void *arg)
{
  struct adc_dev_s   *dev  = (struct adc_dev_s *)arg;
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t value;
  int i;

  /* Verify that the upper-half driver has bound its callback functions */

  if (priv->cb != NULL)
    {
      DEBUGASSERT(priv->cb->au_receive != NULL);

