apache/nuttx/arch/arm/src/stm32l4/stm32l4_dfsdm.c
      for (i = 0; i < priv->nchannels; i++)
        {
          value = priv->dmabuffer[priv->current];
          value = (value & DFSDM_FLTRDATAR_RDATA_MASK) >>
                   DFSDM_FLTRDATAR_RDATA_SHIFT;

          priv->cb->au_receive(dev, priv->chanlist[priv->current], value);
          priv->current++;
          if (priv->current >= priv->nchannels)
            {
              /* Restart the conversion sequence from the beginning */

              priv->current = 0;
            }
        }
    }

  /* Restart DMA for the next conversion series */

  dfsdm_modifyreg(priv, FLTCR1_OFFSET(priv), DFSDM_FLTCR1_RDMAEN, 0);
  dfsdm_modifyreg(priv, FLTCR1_OFFSET(priv), 0, DFSDM_FLTCR1_RDMAEN);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_dfsdm_initialize
 *
 * Description:
 *   Initialize the DFSDM.
 *
 * Input Parameters:
 *   intf      - Could be {0,1,2,3} for DFSDM1 FLT0, FLT1, FLT2, FLT3
 *   chanlist  - The list of channels
 *   cchannels - Number of channels
 *
 * Returned Value:
 *   Valid ADC device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct adc_dev_s *stm32_dfsdm_initialize(int intf, const uint8_t *chanlist,
                                         int cchannels)
{
  struct adc_dev_s   *dev;
  struct stm32_dev_s *priv;

  ainfo("intf: %d cchannels: %d\n", intf, cchannels);

  switch (intf)
    {
#if defined(CONFIG_STM32_DFSDM1_FLT0)
      case 0:
        ainfo("DFSDM FLT0 selected\n");
        dev = &g_dfsdmdev0;
        break;
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT1)
      case 1:
        ainfo("DFSDM FLT1 selected\n");
        dev = &g_dfsdmdev1;
        break;
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT2)
      case 2:
        ainfo("DFSDM FLT2 selected\n");
        dev = &g_dfsdmdev2;
        break;
#endif
#if defined(CONFIG_STM32_DFSDM1_FLT3)
      case 3:
        ainfo("DFSDM FLT3 selected\n");
        dev = &g_dfsdmdev3;
        break;
#endif
      default:
        aerr("ERROR: No DFSDM interface defined\n");
        return NULL;
    }

  /* Configure the selected DFSDM */

  priv = (struct stm32_dev_s *)dev->ad_priv;
  priv->cb = NULL;

  DEBUGASSERT(cchannels <= DFSDM_MAX_CHANNELS);

  /* TODO: regular conversion supports one channel only. */

#if 0
  if (cchannels > DFSDM_MAX_CHANNELS)
    {
      cchannels = DFSDM_MAX_CHANNELS;
    }
#else
  if (cchannels > 1)
    {
      cchannels = 1;
#  warning "Only one channel supported at the moment!"
    }
#endif

  priv->cchannels = cchannels;
  memcpy(priv->chanlist, chanlist, cchannels);

  return dev;
}

#endif /* CONFIG_STM32_DFSDM */
#endif /* CONFIG_ADC */
